In [2]:
import pandas as pd
series = pd.Series(["toyota","madza","bmw","nissan"])
series

0    toyota
1     madza
2       bmw
3    nissan
dtype: object

In [3]:
color = (["black","white","blue","brown"])
car_data = pd.DataFrame({"Car Make": series, "color":color})

In [4]:
car_data

  Car Make  color
0   toyota  black
1    madza  white
2      bmw   blue
3   nissan  brown

In [6]:
#importing data
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [8]:
car_sales.to_excel("exported-car-sales.xls")